Revit 2027 API
ConnectorProfileType Enumeration
 An enumerated type listing all connector profile types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConnectorProfileType
Public Enumeration ConnectorProfileType
public enum class ConnectorProfileType
type ConnectorProfileType
Members
Member name | Value | Description
Invalid | -1 |  Invalid connector profile
Oval | 2 |  Oval connector profile
Rectangular | 1 |  Rectangular connector profile
Round | 0 |  Round connector profile
See Also
Reference
Autodesk.Revit.DB Namespace